Revit 2027 API
RebarContainerItem.DoesBarExistAtPosition Method
 Checks whether a bar exists at the specified position.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool DoesBarExistAtPosition(
	int barPosition
)
Public Function DoesBarExistAtPosition (
	barPosition As Integer
) As Boolean
public:
bool DoesBarExistAtPosition(
	int barPosition
)
member DoesBarExistAtPosition :
        barPosition : int -> bool
Parameters
barPosition Int32
 A bar position index between 0 and NumberOfBarPositions-1.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  barPosition is not in the range [ 0, NumberOfBarPositions-1 ].
Remarks
 Returns true, unless the bar position is the first or last in the set and it is suppressed by IncludeFirstBar or IncludeLastBar.
See Also
Reference
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace